//=============================================================================
//
// 攻撃処理 [attack.h]
// Author : GP11B132 36 向田駿平
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "fire.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define ATTACK_MAX		(5)			// 攻撃のMax数
#define STAR_MAX		(100)		//パーティクルの最大値
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitAttack(void);
void UninitAttack(void);
void UpdateAttack(void);
void DrawAttack(void);

PARTICLE *GetAttack(void);
void SetAttack(D3DXVECTOR3 pos,DIRECTION vect);

