//=============================================================================
//
// ヒットエフェクトの処理【hiteffect.cpp】
// Author : GP11B132 36 向田駿平
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "summon.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define HITEFFECT_MAX					(5)

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitHitEffect(void);
void UninitHitEffect(void);
void UpdateHitEffect(void);
void DrawHitEffect(void);

EFFECT *GetHitEffect(void);
void SetHitEffect(D3DXVECTOR3 pos);


