//=============================================================================
//
// レーザーの処理【laser.cpp】
// Author :GP11B132 36  向田駿平
////
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "fire.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define LASER_MAX					(4)
#define LASER_STOCK					(4)
#define PARTICLE_MAX					(30)
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitLaser(void);
void UninitLaser(void);
void UpdateLaser(void);
void DrawLaser(void);

PARTICLE *GetLaser(void);
void SetLaser(D3DXVECTOR3 pos,DIRECTION vect);