//=============================================================================
//
// 召喚処理【summon.cpp】
// Author : GP11B132 36 向田駿平
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "effect.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SUMMON_MAX					(20)

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSummon(void);
void UninitSummon(void);
void UpdateSummon(void);
void DrawSummon(void);

EFFECT *GetSummon(void);
void SetSummon(D3DXVECTOR3 pos,int type);


