
//=============================================================================
//
// タイトル処理[title.cpp]
// Author : GP11B132 36 向田駿平
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//ポップ判定のある用の構造体
struct CURSORPOP
{
	bool					use;						// true:使っている  false:未使用
	float					w, h;					// 幅と高さ
	D3DXVECTOR3				pos;						// ポリゴンの座標
	int						texNo;					// テクスチャ番号
	bool					pop;//cursorが合わさっているかどうか
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

D3DXCOLOR SetColor(int start);
